public class Exercise04_page20 {
    public static void main(String[] args) {
        int a = 10;
        int b = 20;
        int sum;
        int multiply;
        int sum2;
        sum = a + b;
        multiply = a * b;
        sum2 = sum + multiply;
        System.out.println(sum2);
    }
}

/* Написать метод, который принимает на вход два целых числа, делает их
суммированиеи складывает результат с проихведением двух этиъ чисел, и
возвращает полученный результат их метода. Передать на вход в метод любые два числа.
Вывести полученный результат работы метода на экран.
 */

// Я не до конца понял как правильно создать метод
